cases/artigo_mestrado/on-caso-1.2/fluid/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

// on-caso-1.2 - pressao cinematica p/rho (pimpleFluid incompressivel).
// P_CSF = 1333 Pa  =>  p_kinematic = 1333 / 1000 = 1.333 m^2/s^2
//
// MODO ICP-DRIVEN (compartimentalizacao SANS, dura expandindo):
//   inlet (z=0, cisterna quiasmatica): PIC em RAMPA de 1333 Pa (saudavel) ate
//     3800 Pa (SANS / hipertensao intracraniana), ao longo de 6 janelas de
//     acoplamento (t=1..6). A rampa em passos pequenos de carga e' o que faz o
//     Neo-Hookean do CalculiX convergir (sem rampa, FSI diverge p/ ICP>1500 Pa).
//   outlet_peri (z=30.5): referencia venosa episcleral (p=0).
//   lid distal (peri_porous) com Darcy d=1e16 = drenagem perineural OBSTRUIDA
//     (vilositosidades aracnoideas comprometidas). Quase nada drena -> a SAS
//     pressuriza ate ~ p_inlet -> empurra a DURA para fora (expansao/distensao
//     da bainha do nervo optico, o achado classico de SANS/IIH em RM).
//   2 paredes FSI: zeroGradient (acoplamento via Forces do preCICE).
//   2 paredes do lid: zeroGradient (rigidas, sem fluxo).
//
//   p_kin: 1333 Pa -> 1.333 ;  3800 Pa -> 3.800   (passo = 0.4934 / janela)

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1.333;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0   1.333)
            (1   1.333)
            (2   1.8264)
            (3   2.3198)
            (4   2.8132)
            (5   3.3066)
            (6   3.800)
        );
    }

    outlet_peri
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    fsi_pia          { type zeroGradient; }
    fsi_dura         { type zeroGradient; }
    lid_wall_inner   { type zeroGradient; }
    lid_wall_outer   { type zeroGradient; }
}
