cases/artigo_mestrado/on-caso-1.2/fluid/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6144
(
-0.0010266539
-0.0011212931
-0.0012159419
-0.0007628726
-0.00083319587
-0.00090352627
-0.00046977459
-0.00051307945
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
-0.0010266539
-0.0007628726
-0.00046977459
-0.00015862346
0.00015862346
0.00046977459
0.0007628726
0.0010266539
...
)
;
    }
    fsi_pia
    {
        type            calculated;
        value           nonuniform List<scalar> 
960
(
-0.00097857507
-0.00072714679
-0.00044777475
-0.00015119503
0.00015119503
0.00044777475
0.00072714679
0.00097857507
...
)
;
    }
    fsi_dura
    {
        type            calculated;
        value           nonuniform List<scalar> 
960
(
-0.0014836455
-0.0011024481
-0.00067888417
-0.00022923113
0.00022923113
0.00067888417
0.0011024481
0.0014836455
...
)
;
    }
    lid_wall_inner
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
-0.00097857507
-0.00072714679
-0.00044777475
-0.00015119503
0.00015119503
0.00044777475
0.00072714679
0.00097857507
...
)
;
    }
    lid_wall_outer
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
-0.0014836455
-0.0011024481
-0.00067888417
-0.00022923113
0.00022923113
0.00067888417
0.0011024481
0.0014836455
...
)
;
    }
    outlet_peri
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
-0.0010266539
-0.0007628726
-0.00046977459
-0.00015862346
0.00015862346
0.00046977459
0.0007628726
0.0010266539
...
)
;
    }
}


// ************************************************************************* //
